# Константы приложения recipes

INGREDIENTS_NAME_MAX_LENGTH = 200
MEASUREMENT_UNIT_NAME_MAX_LENGTH = 50

MEASUREMENTS_CHOICES = (
    ('банка', 'банка'),
    ('батон', 'батон'),
    ('бутылка', 'бутылка'),
    ('веточка', 'веточка'),
    ('г', 'грамм'),
    ('горсть', 'горсть'),
    ('долька', 'долька'),
    ('звездочка', 'звездочка'),
    ('зубчик', 'зубчик'),
    ('капля', 'капля'),
    ('кг', 'килограмм'),
    ('кусок', 'кусок'),
    ('л', 'литр'),
    ('лист', 'лист'),
    ('мл', 'миллилитр'),
    ('пакет', 'пакет'),
    ('пакетик', 'пакетик'),
    ('пачка', 'пачка'),
    ('пласт', 'пласт'),
    ('по вкусу', 'по вкусу'),
    ('пучок', 'пучок'),
    ('ст. л.', 'столовая ложка'),
    ('стакан', 'стакан'),
    ('стебель', 'стебель'),
    ('стручок', 'стручок'),
    ('тушка', 'тушка'),
    ('упаковка', 'упаковка'),
    ('ч. л.', 'чайная ложка'),
    ('шт.', 'штука'),
    ('щепотка', 'щепотка'),
)

CORRECT_MEASUREMENTS = set(i[0] for i in MEASUREMENTS_CHOICES)
